---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ArcRunRadiusTooSmall
source: html/a641eb73-aad6-21d7-cd3b-54a51590143e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ArcRunRadiusTooSmall Property

Can't create Run. Run radius is too small.

## Syntax (C#)
```csharp
public static FailureDefinitionId ArcRunRadiusTooSmall { get; }
```